---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheetType.MajorLapSpliceLength
source: html/059e1c99-2258-4f73-e7a1-91d010277028.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.MajorLapSpliceLength Property

The lap splice length in the major direction.

## Syntax (C#)
```csharp
public double MajorLapSpliceLength { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: majorLapSpliceLength is greater than the half of the overall length.